{"<PAD>": 0, "<SOS>": 1, "<EOS>": 2, "KEY_Bb_MAJOR": 3, "STYLE_COOL": 4, "TEMPO_220": 5, "BAR": 6, "BEAT_1": 7, "CHORD_Bb_MAJ": 8, "BEAT_3": 9, "CHORD_G_DOM": 10, "CHORD_C_MIN7": 11, "CHORD_F_DOM": 12, "CHORD_G_MIN7": 13, "CHORD_F_MIN7": 14, "CHORD_Bb_DOM": 15, "CHORD_Eb_DOM": 16, "CHORD_Ab_DOM": 17, "CHORD_D_MIN7": 18, "CHORD_D_DOM": 19, "CHORD_C_DOM": 20, "TIME_SHIFT_48": 21, "NOTE_65": 22, "DURATION_12": 23, "TIME_SHIFT_25": 24, "NOTE_63": 25, "DURATION_15": 26, "TIME_SHIFT_16": 27, "NOTE_58": 28, "DURATION_7": 29, "TIME_SHIFT_7": 30, "NOTE_61": 31, "DURATION_21": 32, "TIME_SHIFT_23": 33, "DURATION_10": 34, "TIME_SHIFT_22": 35, "TIME_SHIFT_3": 36, "DURATION_16": 37, "TIME_SHIFT_24": 38, "DURATION_42": 39, "TIME_SHIFT_21": 40, "TIME_SHIFT_4": 41, "NOTE_50": 42, "DURATION_13": 43, "NOTE_57": 44, "TIME_SHIFT_13": 45, "NOTE_60": 46, "TIME_SHIFT_6": 47, "NOTE_55": 48, "DURATION_9": 49, "TIME_SHIFT_9": 50, "DURATION_25": 51, "DURATION_34": 52, "TIME_SHIFT_36": 53, "NOTE_56": 54, "TIME_SHIFT_12": 55, "NOTE_59": 56, "TIME_SHIFT_1": 57, "NOTE_54": 58, "TIME_SHIFT_15": 59, "TIME_SHIFT_10": 60, "DURATION_6": 61, "TIME_SHIFT_19": 62, "DURATION_4": 63, "NOTE_62": 64, "DURATION_22": 65, "TIME_SHIFT_31": 66, "TIME_SHIFT_14": 67, "TIME_SHIFT_28": 68, "DURATION_1": 69, "NOTE_53": 70, "TIME_SHIFT_34": 71, "TIME_SHIFT_11": 72, "NOTE_68": 73, "NOTE_67": 74, "NOTE_66": 75, "DURATION_37": 76, "TIME_SHIFT_39": 77, "DURATION_3": 78, "TIME_SHIFT_5": 79, "TIME_SHIFT_45": 80, "NOTE_64": 81, "DURATION_43": 82, "TIME_SHIFT_46": 83, "NOTE_69": 84, "NOTE_70": 85, "NOTE_72": 86, "NOTE_74": 87, "TIME_SHIFT_18": 88, "DURATION_19": 89, "DURATION_28": 90, "DURATION_18": 91, "DURATION_111": 92, "DURATION_46": 93, "NOTE_75": 94, "NOTE_77": 95, "NOTE_79": 96, "TIME_SHIFT_30": 97, "NOTE_73": 98, "NOTE_80": 99, "DURATION_31": 100, "TIME_SHIFT_33": 101, "TIME_SHIFT_8": 102, "NOTE_51": 103, "NOTE_52": 104, "DURATION_39": 105, "TIME_SHIFT_40": 106, "DURATION_85": 107, "NOTE_71": 108, "NOTE_78": 109, "TIME_SHIFT_17": 110, "NOTE_81": 111, "NOTE_82": 112, "NOTE_84": 113, "NOTE_86": 114, "DURATION_124": 115, "NOTE_76": 116, "TIME_SHIFT_42": 117, "TIME_SHIFT_37": 118, "DURATION_40": 119, "DURATION_70": 120, "DURATION_61": 121, "NOTE_83": 122, "NOTE_89": 123, "NOTE_85": 124, "TIME_SHIFT_26": 125, "DURATION_67": 126, "TIME_SHIFT_43": 127, "NOTE_91": 128, "NOTE_87": 129, "DURATION_102": 130, "DURATION_36": 131, "DURATION_60": 132, "NOTE_90": 133, "TIME_SHIFT_20": 134, "DURATION_79": 135, "DURATION_57": 136, "KEY_Eb_MAJOR": 137, "TEMPO_200": 138, "DURATION_51": 139, "TIME_SHIFT_27": 140, "DURATION_106": 141, "DURATION_33": 142, "NOTE_49": 143, "TIME_SHIFT_0": 144, "DURATION_45": 145, "TIME_SHIFT_41": 146, "DURATION_30": 147, "DURATION_24": 148, "DURATION_52": 149, "TIME_SHIFT_29": 150, "DURATION_27": 151, "DURATION_48": 152, "DURATION_49": 153, "KEY_F_MAJOR": 154, "TEMPO_140": 155, "CHORD_F_MAJ7": 156, "CHORD_A_HDIM": 157, "CHORD_A_DOM": 158, "CHORD_Gb_MAJ7": 159, "CHORD_Bb_MIN": 160, "CHORD_A_MIN7": 161, "CHORD_B_HDIM": 162, "CHORD_E_DOM": 163, "CHORD_A_MAJ7": 164, "CHORD_Bb_DIM7": 165, "CHORD_B_MIN7": 166, "CHORD_Gb_MIN7": 167, "CHORD_C_MAJ7": 168, "CHORD_Db_DIM7": 169, "DURATION_63": 170, "DURATION_58": 171, "TEMPO_170": 172, "CHORD_Eb_MAJ": 173, "CHORD_Bb_MIN7": 174, "CHORD_Ab_MAJ7": 175, "CHORD_Ab_MAJ": 176, "CHORD_Db_DOM": 177, "CHORD_A_DIM7": 178, "CHORD_Db_MAJ": 179, "TIME_SHIFT_38": 180, "TEMPO_60": 181, "CHORD_Ab_MIN": 182, "BEAT_4": 183, "CHORD_E_DIM7": 184, "CHORD_Bb_DIM": 185, "CHORD_Eb_MAJ7": 186, "CHORD_Bb_SUS": 187, "CHORD_Eb_AUG": 188, "CHORD_E_DIM": 189, "CHORD_Ab_MIN7": 190, "TIME_SHIFT_2": 191, "TIME_SHIFT_32": 192, "TIME_SHIFT_35": 193, "KEY_Db_MAJOR": 194, "STYLE_SWING": 195, "TEMPO_70": 196, "CHORD_Db_MAJ7": 197, "CHORD_Eb_MIN7": 198, "BEAT_2": 199, "CHORD_Gb_MIN": 200, "CHORD_B_DOM": 201, "DURATION_54": 202, "DURATION_82": 203, "DURATION_211": 204, "KEY_C_MAJOR": 205, "TEMPO_120": 206, "CHORD_E_MIN7": 207, "TIME_SHIFT_44": 208, "TEMPO_130": 209, "CHORD_D_MIN": 210, "CHORD_NC": 211, "DURATION_93": 212, "CHORD_Bb_MAJ7": 213, "CHORD_E_HDIM": 214, "CHORD_F_MAJ": 215, "TEMPO_180": 216, "TEMPO_190": 217, "CHORD_Ab_DIM7": 218, "DURATION_165": 219, "KEY_G_MAJOR": 220, "TEMPO_90": 221, "CHORD_G_MAJ7": 222, "CHORD_Eb_DIM": 223, "CHORD_G_MAJ": 224, "CHORD_Db_DIM": 225, "TEMPO_240": 226, "DURATION_64": 227, "DURATION_55": 228, "TEMPO_300": 229, "CHORD_Gb_DIM": 230, "CHORD_F_MIN": 231, "CHORD_Bb_HDIM": 232, "DURATION_145": 233, "DURATION_192": 234, "KEY_Ab_MAJOR": 235, "TEMPO_310": 236, "DURATION_73": 237, "TEMPO_280": 238, "CHORD_C_MIN": 239, "CHORD_G_MIN": 240, "DURATION_91": 241, "DURATION_88": 242, "TEMPO_270": 243, "CHORD_Db_MIN": 244, "DURATION_109": 245, "DURATION_100": 246, "DURATION_120": 247, "CHORD_C_AUG": 248, "CHORD_Bb_AUG": 249, "DURATION_75": 250, "DURATION_97": 251, "CHORD_D_DIM": 252, "CHORD_Gb_DOM": 253, "CHORD_Db_MIN7": 254, "DURATION_78": 255, "KEY_D_MAJOR": 256, "CHORD_D_MAJ7": 257, "CHORD_Ab_HDIM": 258, "CHORD_F_DIM": 259, "CHORD_D_MAJ": 260, "DURATION_90": 261, "TEMPO_80": 262, "CHORD_Eb_SUS": 263, "NOTE_48": 264, "STYLE_TRADITIONAL": 265, "CHORD_Ab_DIM": 266, "CHORD_A_MIN": 267, "CHORD_C_MAJ": 268, "TIME_SHIFT_47": 269, "TEMPO_210": 270, "CHORD_A_DIM": 271, "CHORD_C_DIM": 272, "STYLE_POSTBOP": 273, "NOTE_47": 274, "NOTE_46": 275, "DURATION_157": 276, "DURATION_76": 277, "NOTE_44": 278, "DURATION_114": 279, "DURATION_259": 280, "DURATION_115": 281, "DURATION_142": 282, "KEY_C_MINOR": 283, "TEMPO_250": 284, "CHORD_D_DIM7": 285, "DURATION_180": 286, "NOTE_45": 287, "DURATION_108": 288, "DURATION_69": 289, "DURATION_250": 290, "DURATION_96": 291, "NOTE_43": 292, "CHORD_A_AUG": 293, "CHORD_G_SUS": 294, "CHORD_C_SUS": 295, "CHORD_F_SUS": 296, "DURATION_223": 297, "DURATION_174": 298, "DURATION_273": 299, "DURATION_84": 300, "TEMPO_160": 301, "CHORD_F_AUG": 302, "CHORD_G_AUG": 303, "DURATION_66": 304, "STYLE_FUSION": 305, "TEMPO_110": 306, "KEY_G_MINOR": 307, "CHORD_D_HDIM": 308, "CHORD_G_HDIM": 309, "DURATION_222": 310, "DURATION_154": 311, "TEMPO_40": 312, "CHORD_D_SUS": 313, "CHORD_G_DIM7": 314, "CHORD_Gb_HDIM": 315, "TEMPO_260": 316, "DURATION_190": 317, "CHORD_F_HDIM": 318, "CHORD_Gb_MAJ": 319, "DURATION_127": 320, "TEMPO_230": 321, "STYLE_HARDBOP": 322, "CHORD_C_HDIM": 323, "KEY_D_MINOR": 324, "CHORD_Eb_MIN": 325, "CHORD_G_DIM": 326, "KEY_F_MINOR": 327, "STYLE_BEBOP": 328, "DURATION_118": 329, "CHORD_B_DIM7": 330, "CHORD_B_MAJ7": 331, "DURATION_189": 332, "TEMPO_150": 333, "KEY_Bb_MINOR": 334, "DURATION_130": 335, "DURATION_148": 336, "CHORD_Gb_DIM7": 337, "DURATION_94": 338, "TEMPO_50": 339, "CHORD_D_MINMAJ7": 340, "CHORD_G_MINMAJ7": 341, "NOTE_88": 342, "CHORD_Eb_DIM7": 343, "KEY_Db_MINOR": 344, "CHORD_E_MAJ7": 345, "CHORD_Ab_AUG": 346, "TEMPO_290": 347, "TEMPO_100": 348, "CHORD_D_AUG": 349, "CHORD_B_AUG": 350, "CHORD_Fb_MIN7": 351, "DURATION_112": 352, "CHORD_B_DIM": 353, "CHORD_E_MIN": 354, "DURATION_81": 355, "KEY_Gb_MINOR": 356, "DURATION_196": 357, "DURATION_133": 358, "KEY_E_MINOR": 359, "CHORD_B_MAJ": 360, "NOTE_93": 361, "NOTE_92": 362, "DURATION_291": 363, "DURATION_129": 364, "DURATION_126": 365, "NOTE_42": 366, "DURATION_300": 367, "DURATION_121": 368, "DURATION_136": 369, "CHORD_Eb_HDIM": 370, "CHORD_Cb_DOM": 371, "DURATION_163": 372, "DURATION_72": 373, "DURATION_139": 374, "DURATION_117": 375, "DURATION_160": 376, "DURATION_166": 377, "KEY_A_MINOR": 378, "DURATION_105": 379, "CHORD_Db_AUG": 380, "CHORD_E_MAJ": 381, "NOTE_41": 382, "NOTE_37": 383, "NOTE_39": 384, "DURATION_135": 385, "DURATION_99": 386, "DURATION_103": 387, "NOTE_38": 388, "DURATION_169": 389, "DURATION_403": 390, "DURATION_178": 391, "CHORD_F_MINMAJ7": 392, "TEMPO_320": 393, "CHORD_Gb_SUS": 394, "DURATION_151": 395, "KEY_Eb_MINOR": 396, "DURATION_256": 397, "KEY_B_MAJOR": 398, "DURATION_147": 399, "CHORD_Eb_MINMAJ7": 400, "CHORD_Ab_SUS": 401, "TEMPO_340": 402, "DURATION_87": 403, "CHORD_B_MIN": 404, "CHORD_A_MAJ": 405, "DURATION_150": 406, "DURATION_175": 407, "DURATION_183": 408, "CHORD_Cb_MAJ7": 409, "DURATION_364": 410, "DURATION_306": 411, "DURATION_172": 412, "NOTE_97": 413, "NOTE_96": 414, "NOTE_94": 415, "DURATION_162": 416, "DURATION_123": 417, "DURATION_373": 418, "DURATION_132": 419, "CHORD_A_SUS": 420, "CHORD_Db_SUS": 421, "CHORD_B_SUS": 422, "DURATION_226": 423, "DURATION_249": 424, "DURATION_346": 425, "CHORD_Db_HDIM": 426, "NOTE_36": 427, "NOTE_40": 428, "DURATION_141": 429, "DURATION_202": 430, "TEMPO_360": 431, "DURATION_153": 432, "DURATION_220": 433, "NOTE_95": 434, "DURATION_181": 435, "DURATION_156": 436, "DURATION_261": 437, "CHORD_E_AUG": 438, "CHORD_F_DIM7": 439, "DURATION_159": 440, "DURATION_216": 441}